---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData
source: html/318f4c07-0d19-d2b6-dd01-bbd8b36af573.htm
---
# RebarUpdateCurvesData Properties

Orientation options for an Aligned Free Form Rebar set.